In [4]:
import pandas as pd

In [5]:
df=pd.read_csv(r"C:\Users\hp\Desktop\Bengaluru_House_Data.csv")

In [6]:
df.isnull()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False
4,False,False,False,False,True,False,False,False,False
...,...,...,...,...,...,...,...,...,...
13315,False,False,False,False,False,False,False,False,False
13316,False,False,False,False,True,False,False,True,False
13317,False,False,False,False,False,False,False,False,False
13318,False,False,False,False,False,False,False,False,False
13319,False,False,False,False,True,False,False,False,False

In [7]:
df.isnull().sum()

area_type          0
availability       0
location           1
size              16
society         5501
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [8]:
#let find percentage of each field which has missing value

In [9]:
#find percent of missing data in location
a=df["location"].isnull().sum()
b=df.shape[0]
per=(a/b)*100
print("percent per of missing data in location:",per)

percent per of missing data in location: 0.0075075075075075074

In [10]:
#find percent of missing data in size
a=df["size"].isnull().sum()
b=df.shape[0]
per=(a/b)*100
print("percent of missing data in size:",per)

percent of missing data in size: 0.12012012012012012

In [11]:
#find percent of missing data in society
a=df["society"].isnull().sum()
b=df.shape[0]
per=(a/b)*100
print("percent of missin data in society:",per)
#we do not ignore data in the file because it can change the analysis of the data 
#we can ignore data of any field  which having less than or = 5%

percent of missin data in society: 41.2987987987988

In [12]:
#find the percent of missing data in bath 
a=df["bath"].isnull().sum()
b=df.shape[0]
per=(a/b)*100
print("percentage of missing data in bath:",per)

percentage of missing data in bath: 0.5480480480480481

In [13]:
#find the percent of missing data in balcony 
a=df["balcony"].isnull().sum()
b=df.shape[0]
per=(a/b)*100
print("percentage of missing data in balcony:",per)

percentage of missing data in balcony: 4.572072072072072

In [14]:
#AFTER FIND PERCENT OF ALL COLOUM MISSING DATA WE NEED TO FILL ALL THE MISSING VALUE 
#IN THE DATA TO ANALYSE IT PROPERLE

In [15]:
#in this data ignore missing data of location,size,balcony,bath because the data in
#these coloum is less than 5%
#we only fill the data of society because it's missing value percent is 41.2%

In [28]:
#socity is a catagorical data than we find mode of socity
df["society"].mode()

0    GrrvaGr
Name: society, dtype: object

In [29]:
#a=df["society"].mode()
#df["society"].fillna(a)
#df

0        Coomee
1        Theanmp
2         @@@@@@
3        Soiewre
4            NaN
          ...
13315    ArsiaEx
13316        NaN
13317    Mahla T
13318    SollyCl
13319        NaN
Name: society, Length: 13320, dtype: object

In [38]:
df["society"].fillna("GrrvaGr",inplace=True)
df

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,@@@@@@,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,GrrvaGr,1200,2.0,1.0,51.00
...,...,...,...,...,...,...,...,...,...
13315,Built-up Area,Ready To Move,Whitefield,5 Bedroom,ArsiaEx,3453,4.0,0.0,231.00
13316,Super built-up Area,Ready To Move,Richards Town,4 BHK,GrrvaGr,3600,5.0,NaN,400.00
13317,Built-up Area,Ready To Move,Raja Rajeshwari Nagar,2 BHK,Mahla T,1141,2.0,1.0,60.00
13318,Super built-up Area,18-Jun,Padmanabhanagar,4 BHK,SollyCl,4689,4.0,1.0,488.00
13319,Super built-up Area,Ready To Move,Doddathoguru,1 BHK,GrrvaGr,550,1.0,1.0,17.00

In [39]:
df.isnull().sum()

area_type         0
availability      0
location          1
size             16
society           0
total_sqft        0
bath             73
balcony         609
price             0
dtype: int64

In [40]:
#now we can start analysis of the data df1
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13304 non-null  object
 4   society       13320 non-null  object
 5   total_sqft    13320 non-null  object
 6   bath          13247 non-null  float64
 7   balcony       12711 non-null  float64
 8   price         13320 non-null  float64
dtypes: float64(3), object(6)
memory usage: 936.7+ KB

In [41]:
#finding breif defination of the data in percentile
df.describe()

               bath       balcony         price
count  13247.000000  12711.000000  13320.000000
mean       2.692610      1.584376    112.565627
std        1.341458      0.817263    148.971674
min        1.000000      0.000000      8.000000
25%        2.000000      1.000000     50.000000
50%        2.000000      2.000000     72.000000
75%        3.000000      2.000000    120.000000
max       40.000000      3.000000   3600.000000

In [42]:
#finding correlation in thr numerical data 
df.corr()

             bath   balcony     price
bath     1.000000  0.204201  0.456345
balcony  0.204201  1.000000  0.120355
price    0.456345  0.120355  1.000000

In [43]:
#these function are used to analise the data